In [26]:
import pandas as pd
import os

In [27]:
bank_dataset = pd.read_csv("datasets/Bank_Churn.csv")

In [28]:
bank_dataset.head()

,RowNumber,CustomerId,CreditScore,GeographyID,GenderID,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Bank DOJ
0,1,15634602,619,1,2,42,7,0.00,1,1,1,101348.88,1,23-03-2016
1,2,15647311,608,2,2,41,4,83807.86,1,0,1,112542.58,0,09-10-2018
2,3,15619304,502,1,2,42,4,159660.80,3,1,0,113931.57,1,25-03-2019
3,4,15701354,699,1,2,39,3,0.00,2,0,0,93826.63,0,24-10-2019
4,5,15737888,850,2,2,43,3,125510.82,1,1,1,79084.10,0,22-11-2019

In [29]:
customer_info = pd.read_csv("datasets/CustomerInfo.csv")

In [30]:
customer_info.head()

   CustomerId   Surname
0    15634602  Hargrave
1    15647311      Hill
2    15619304      Onio
3    15701354      Boni
4    15737888  Mitchell

In [31]:
merged_df = bank_dataset.merge(customer_info[["CustomerId", "Surname"]], 
                               on="CustomerId", how="left")

In [32]:
merged_df.head()

,RowNumber,CustomerId,CreditScore,GeographyID,GenderID,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Bank DOJ,Surname
0,1,15634602,619,1,2,42,7,0.00,1,1,1,101348.88,1,23-03-2016,Hargrave
1,2,15647311,608,2,2,41,4,83807.86,1,0,1,112542.58,0,09-10-2018,Hill
2,3,15619304,502,1,2,42,4,159660.80,3,1,0,113931.57,1,25-03-2019,Onio
3,4,15701354,699,1,2,39,3,0.00,2,0,0,93826.63,0,24-10-2019,Boni
4,5,15737888,850,2,2,43,3,125510.82,1,1,1,79084.10,0,22-11-2019,Mitchell

In [33]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   CreditScore      10000 non-null  int64
 3   GeographyID      10000 non-null  int64
 4   GenderID         10000 non-null  int64
 5   Age              10000 non-null  int64
 6   Tenure           10000 non-null  int64
 7   Balance          10000 non-null  float64
 8   NumOfProducts    10000 non-null  int64
 9   HasCrCard        10000 non-null  int64
 10  IsActiveMember   10000 non-null  int64
 11  EstimatedSalary  10000 non-null  float64
 12  Exited           10000 non-null  int64
 13  Bank DOJ         10000 non-null  object
 14  Surname          10000 non-null  object
dtypes: float64(2), int64(11), object(2)
memory usage: 1.1+ MB

In [34]:
active_customer = pd.read_excel("datasets/ActiveCustomer.xlsx")
active_map = dict(zip(
    active_customer["ActiveID"],
    active_customer["ActiveCategory"]
))

credit_customer = pd.read_excel("datasets/CreditCard.xlsx")
credit_map = dict(zip(
    credit_customer["CreditID"],
    credit_customer["Category"]
))

exit_customer = pd.read_excel("datasets/ExitCustomer.xlsx")
exit_map = dict(zip(
    exit_customer["ExitID"],
    exit_customer["ExitCategory"]
))

gender_customer = pd.read_excel("datasets/Gender.xlsx")
gender_map = dict(zip(
    gender_customer["GenderID"],
    gender_customer["GenderCategory"]
))

geo_customer = pd.read_excel("datasets/Geography.xlsx")
geo_map = dict(zip(
    geo_customer["GeographyID"],
    geo_customer["GeographyLocation"]
))

In [35]:
merged_df["IsActiveMember"] = merged_df["IsActiveMember"].map(active_map)
merged_df["HasCrCard"] = merged_df["HasCrCard"].map(credit_map)
merged_df["Exited"] = merged_df["Exited"].map(exit_map)
merged_df["GenderID"] = merged_df["GenderID"].map(gender_map)
merged_df["GeographyID"] = merged_df["GeographyID"].map(geo_map)

In [36]:
merged_df.head()

,RowNumber,CustomerId,CreditScore,GeographyID,GenderID,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Bank DOJ,Surname
0,1,15634602,619,France,Female,42,7,0.00,1,credit card holder,Active Member,101348.88,Exit,23-03-2016,Hargrave
1,2,15647311,608,Spain,Female,41,4,83807.86,1,non credit card holder,Active Member,112542.58,Retain,09-10-2018,Hill
2,3,15619304,502,France,Female,42,4,159660.80,3,credit card holder,Inactive Member,113931.57,Exit,25-03-2019,Onio
3,4,15701354,699,France,Female,39,3,0.00,2,non credit card holder,Inactive Member,93826.63,Retain,24-10-2019,Boni
4,5,15737888,850,Spain,Female,43,3,125510.82,1,credit card holder,Active Member,79084.10,Retain,22-11-2019,Mitchell

In [37]:

merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   CreditScore      10000 non-null  int64
 3   GeographyID      10000 non-null  object
 4   GenderID         10000 non-null  object
 5   Age              10000 non-null  int64
 6   Tenure           10000 non-null  int64
 7   Balance          10000 non-null  float64
 8   NumOfProducts    10000 non-null  int64
 9   HasCrCard        10000 non-null  object
 10  IsActiveMember   10000 non-null  object
 11  EstimatedSalary  10000 non-null  float64
 12  Exited           10000 non-null  object
 13  Bank DOJ         10000 non-null  object
 14  Surname          10000 non-null  object
dtypes: float64(2), int64(6), object(7)
memory usage: 1.1+ MB

In [38]:
merged_df.head()

,RowNumber,CustomerId,CreditScore,GeographyID,GenderID,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Bank DOJ,Surname
0,1,15634602,619,France,Female,42,7,0.00,1,credit card holder,Active Member,101348.88,Exit,23-03-2016,Hargrave
1,2,15647311,608,Spain,Female,41,4,83807.86,1,non credit card holder,Active Member,112542.58,Retain,09-10-2018,Hill
2,3,15619304,502,France,Female,42,4,159660.80,3,credit card holder,Inactive Member,113931.57,Exit,25-03-2019,Onio
3,4,15701354,699,France,Female,39,3,0.00,2,non credit card holder,Inactive Member,93826.63,Retain,24-10-2019,Boni
4,5,15737888,850,Spain,Female,43,3,125510.82,1,credit card holder,Active Member,79084.10,Retain,22-11-2019,Mitchell

In [39]:
merged_df = merged_df.rename(columns={
    "RowNumber": "Row_Number",
    "CustomerId": "Customer_ID",
    "CreditScore": "Credit_Score",
    "GeographyID": "Country",
    "GenderID": "Gender",
    "Age": "Age",
    "Tenure": "Tenure_Years",
    "Balance": "Account_Balance",
    "NumOfProducts": "Number_Of_Products",
    "HasCrCard": "Has_Credit_Card",
    "IsActiveMember": "Active_Status",
    "EstimatedSalary": "Estimated_Salary_EUR",
    "Exited": "Churn_Status",
    "Bank DOJ": "Bank_Join_Date",
    "Surname": "Customer_Surname"
})

In [40]:
merged_df.head()

,Row_Number,Customer_ID,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status,Bank_Join_Date,Customer_Surname
0,1,15634602,619,France,Female,42,7,0.00,1,credit card holder,Active Member,101348.88,Exit,23-03-2016,Hargrave
1,2,15647311,608,Spain,Female,41,4,83807.86,1,non credit card holder,Active Member,112542.58,Retain,09-10-2018,Hill
2,3,15619304,502,France,Female,42,4,159660.80,3,credit card holder,Inactive Member,113931.57,Exit,25-03-2019,Onio
3,4,15701354,699,France,Female,39,3,0.00,2,non credit card holder,Inactive Member,93826.63,Retain,24-10-2019,Boni
4,5,15737888,850,Spain,Female,43,3,125510.82,1,credit card holder,Active Member,79084.10,Retain,22-11-2019,Mitchell

In [41]:
merged_df.columns

Index(['Row_Number', 'Customer_ID', 'Credit_Score', 'Country', 'Gender', 'Age',
       'Tenure_Years', 'Account_Balance', 'Number_Of_Products',
       'Has_Credit_Card', 'Active_Status', 'Estimated_Salary_EUR',
       'Churn_Status', 'Bank_Join_Date', 'Customer_Surname'],
      dtype='object')

In [42]:
merged_df = merged_df[['Customer_ID', 
                       'Customer_Surname', 'Bank_Join_Date',
                       'Credit_Score', 'Country', 'Gender', 'Age',
       'Tenure_Years', 'Account_Balance', 'Number_Of_Products',
       'Has_Credit_Card', 'Active_Status', 'Estimated_Salary_EUR',
       'Churn_Status']].copy()

In [43]:
merged_df.head()

,Customer_ID,Customer_Surname,Bank_Join_Date,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status
0,15634602,Hargrave,23-03-2016,619,France,Female,42,7,0.00,1,credit card holder,Active Member,101348.88,Exit
1,15647311,Hill,09-10-2018,608,Spain,Female,41,4,83807.86,1,non credit card holder,Active Member,112542.58,Retain
2,15619304,Onio,25-03-2019,502,France,Female,42,4,159660.80,3,credit card holder,Inactive Member,113931.57,Exit
3,15701354,Boni,24-10-2019,699,France,Female,39,3,0.00,2,non credit card holder,Inactive Member,93826.63,Retain
4,15737888,Mitchell,22-11-2019,850,Spain,Female,43,3,125510.82,1,credit card holder,Active Member,79084.10,Retain

In [44]:
merged_df.isna().sum()

Customer_ID             0
Customer_Surname        0
Bank_Join_Date          0
Credit_Score            0
Country                 0
Gender                  0
Age                     0
Tenure_Years            0
Account_Balance         0
Number_Of_Products      0
Has_Credit_Card         0
Active_Status           0
Estimated_Salary_EUR    0
Churn_Status            0
dtype: int64

In [45]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Customer_ID           10000 non-null  int64
 1   Customer_Surname      10000 non-null  object
 2   Bank_Join_Date        10000 non-null  object
 3   Credit_Score          10000 non-null  int64
 4   Country               10000 non-null  object
 5   Gender                10000 non-null  object
 6   Age                   10000 non-null  int64
 7   Tenure_Years          10000 non-null  int64
 8   Account_Balance       10000 non-null  float64
 9   Number_Of_Products    10000 non-null  int64
 10  Has_Credit_Card       10000 non-null  object
 11  Active_Status         10000 non-null  object
 12  Estimated_Salary_EUR  10000 non-null  float64
 13  Churn_Status          10000 non-null  object
dtypes: float64(2), int64(5), object(7)
memory usage: 1.1+ MB

In [46]:
final_df = merged_df.copy()

In [47]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Customer_ID           10000 non-null  int64
 1   Customer_Surname      10000 non-null  object
 2   Bank_Join_Date        10000 non-null  object
 3   Credit_Score          10000 non-null  int64
 4   Country               10000 non-null  object
 5   Gender                10000 non-null  object
 6   Age                   10000 non-null  int64
 7   Tenure_Years          10000 non-null  int64
 8   Account_Balance       10000 non-null  float64
 9   Number_Of_Products    10000 non-null  int64
 10  Has_Credit_Card       10000 non-null  object
 11  Active_Status         10000 non-null  object
 12  Estimated_Salary_EUR  10000 non-null  float64
 13  Churn_Status          10000 non-null  object
dtypes: float64(2), int64(5), object(7)
memory usage: 1.1+ MB

In [48]:
final_df.to_csv("datasets/bank_churn_combined.csv", index=False)